Revit 2026 API

# FailureMessageSetAdditionalElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureMessage SetAdditionalElements(
	ICollection<ElementId> additionalElements
)
```
```vb
Public Function SetAdditionalElements (
	additionalElements As ICollection(Of ElementId)
) As FailureMessage
```
```cpp
public:
FailureMessage^ SetAdditionalElements(
	ICollection<ElementId^>^ additionalElements
)
```
```fsharp
member SetAdditionalElements :
        additionalElements : ICollection<ElementId> -> FailureMessage
```

#### Parameters

additionalElements ICollectionElementId

#### Return Value

FailureMessage

#### Reference

FailureMessage Class

Autodesk.Revit.DB Namespace